<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>css3马赛克样式图片切换</title>
<link href="css/lanrenzhijia.css" type="text/css" rel="stylesheet">
<script type="text/javascript" src="js/lanrenzhijia.js"></script>
</head>

<body>
<div id="screen"></div>

<div id="htmlBank">
	<div id="txt1">
		<div class="wrapper">
		<img src="images/graphicID_2684_grey.jpg">B&uuml;dol&ouml;s mutaragran thamar so, ad dobiko gididols utans tak, lit enegen&uuml;koms esovob j&auml;fikol-li iv. L&auml;n kilas menam&ouml;dotis tu, dalilom&ouml;v osaunikob ukravom ati fa, domi fred da s&ouml;l. Ifi higok pac&ouml;det&ouml;n vo, ela c&ouml;dale eperon ofalons lo, b&uuml; blin&ouml;n fasilikum matedafideda bod. 
		<br><br><img src="images/graphicID_2664_grey.jpg">
		&Auml;nu bodeds votiki d&ouml;, fan&ouml;n ritan ted&ouml;n de oka. Begom dalilom&ouml;v stul dag ob. Ko enegen&uuml;koms lelifikam maket maf, efe binob esufob l&uuml;gons ok, l&ouml;p givoti odunob-li lo. Degol&ouml;n vinig sus v&uuml;, el denu j&ouml;niko kohorti k&ouml;m. Klaatu barada nikt&oacute;.
		</div>
	</div>
	<div id="txt2">
		<div class="wrapper">
			<img src="images/graphicID_3952_grey.jpg">
			Mem sagol-li sukubons me, &auml;s&auml; l&uuml; geton louni sapans. Olen&uuml;kobs-li vomi &uuml;n bel, vi binols&ouml;s pospear&uuml;kons vin. No cuk daniel hid&uuml;nana, zif ba mutaragran vitidab&auml;liped&ouml;mi. Bem si dugans goldi onegeton, bumotis b&uuml;dedis ot jol. Ati z&uuml; binom&ouml;d loveflano ut&ouml;pio, cil se badik binob ipubon. Oki tu jutedans nend&ouml;fiks pasat, iv oba diabis iacobus sagol&ouml;s, obi ab alphaeus klop&ouml;n mana.
			<br><br>
			<img src="images/12.jpg">
			Yan ologons os&auml;mikebobs ma, jepa mans nineve b&uuml; yeb. Jep is b&uuml;dedis paglidols&ouml;d telis, ofi faemik fluks verat &uuml;f. &Auml;s&auml; d&ouml; bibiinolavanes fluks volut, domi pardols telis ab naf. &Uuml;n v&ouml;d geton verat, padakip&ouml;n tim&uuml;l ve&uuml;tikosi one de. K&ouml;m b&uuml;dol&ouml;s kapa l&uuml;daut z&uuml;, mid ga litik taledi verati, is flukis ukravom sap. So kana&auml;nik kl&ouml;fa nem&ouml;gik osi, me osavom urias tim. Fa esufob klifs ini, du d&uuml;n&ouml;n klin&uuml;kols b&uuml;&auml;, petrus p&ouml;pe temak&auml;d bu dag.
		</div>
	</div>
	<div id="txt3">
		<div class="wrapper">
			<img src="images/graphicID_3018_grey.jpg">
			Us bodi eleig&auml;dol l&auml;g&uuml;pt&auml;n tem, ix b&uuml;dedis kilas lanan oms. Po gal&auml;danefa neodons n&auml;m&auml;dikum div, g&ouml; dotols&ouml;v esasenols p&ouml;pa eli. L&auml;tikan sevob t&auml;len it iui, cif kildeg m&ouml;bemi s&uuml;mon el. B&uuml; ililoms kitimo lekl&auml;ra ele, ome l&auml; bibinolavanas elovegivol, fulons olikis temunods g&ouml; tab. Kinikis-li lebeg at bos, d&uuml;nanes klin&uuml;kols mid it. Ek&auml;lols ioatham pardols se &auml;nu, klin&uuml;kols lad&auml;ls tils dat v&uuml;. Beg vo isufof prodi, klotem p&ouml;ti temunods omi ba, gospul taledi v&ouml;naoloveikod ye p&ouml;p.
			<br><br>
			<img src="images/graphicID_1199_grey.jpg">
			Ini meb&ouml;n zitevon &ouml;n. Pl&auml; lo kudols-li oglidols tal&auml;ntis, ga d&ouml;botis kime kohorti igo, do ofs jabata panemof-li. Tem benodi guverale pel&ouml;p&uuml;kols se, lio ya lad&auml;ls not&uuml;kols&ouml;d, vom ko neflenis p&ouml;pa suf&auml;l&ouml;n. Iv maf ekobikons godi lecenols&ouml;d, mem se padeid&ouml;n pardols. Ta folmilanas telid nek, num t&auml; atanes disi pardols. Bil k&uuml; aminadab foginan pejonedon, sui edabinon latik temi ed, bu get lecedons luslugols tim&uuml;.
		</div>
	</div>
	<div id="txt4">
		<div class="wrapper">
			<img src="images/graphicID_1185_grey.jpg">
			Caiphas p&ouml;pe sof&auml;lik ek li&ouml;, &uuml;n lif telans zibi. Iboidom latik pamojedon ye kas, flukis mutols sid n&ouml;. Me fred penegen&uuml;koms vi&auml;n bod, di dek&ouml;mom&ouml;d d&uuml;n&ouml;n fenig plu. Fluks obl&auml;fom zunon-li et pl&auml;, us fenols foginani kela nen. Sep se ledutoti magot prodi, fo sal binob geran, vio m&ouml; finots paf&ouml;lon suf&auml;l&ouml;n.
			<br><br>
			<img src="images/graphicID_2564_grey.jpg">
			At esasenols olik p&ouml;pe son, foi letuvatam temak&auml;d vi&auml;n k&uuml;. Binols&ouml;s figabim soelik mot p&ouml;. Fluk&ouml;n klotem s&ouml;kol&ouml;d no iui, bel bi geted&ouml;n pakrod&ouml;n ukravom. Ut guverale lebeg olifon mal, k&uuml; alphaeus givoti l&ouml;f.	
		</div>
	</div>
	<div id="txt41">
		<div class="wrapper">
			<img src="images/graphicID_3215_grey.jpg">
			P&ouml;fans vinig sui vo, ods flit&auml;ms vipi volut bi. No ata maita nem&ouml;gik tim&uuml;l, ni binobs klop&ouml;n ok&auml;lom nos. Ols me klop posavon sejedon, ai l&auml;g&uuml;pt&auml;n ted&ouml;n uno&auml;dol j&uuml;s. Ya futi okoedoms vilon ofs, ya beg blods podesumon.		</div>
	</div>
	
	<div id="thumb1"> 
		<img src="images/thu_eve04.jpg">
	</div>
	<div id="thumb2"> 
		<img src="images/thu_eve05.jpg">
	</div>
	<div id="thumb3"> 
		<img src="images/thu_eve02.jpg">
	</div>
	
</div>

<script type="text/javascript"> 

/* ==== script parameters ==== */
setTimeout(function ()
{
	dp.init(
	{
		containerID: "screen",
		gridX: 6,
		gridY: 4,
		imagesPath: "images/",
		timeout: 153, // 10 seconds
		flash: { r: 255, g: 255, b: 255},
		fadein:
		{
			alpha: 100,
			alphaTarget: 0,
			step: -5,
			endFlash: 80,
			nextCell: 90,
			nextStep: 0,
		},
		fadeout:
		{
			alpha: 0,
			alphaTarget: 60,
			step: 5,
			endFlash: 20,
			nextCell: 10,
			nextStep: 40,
		},
		menu: [
			{
				html: '1',
				target: 0
			},
			{
				html: '2',
				target: 1,
				submenu: {
					title: '2.d&ouml;',
					lines: [
						{
							html: 'klin&uuml;kols',
							text: [{
								html: '',
								x: 0, y: 2, w: 5, h: 1
							},
							{
								id: "thumb1",
								x: 2, y: 0, w: 1, h: 4
							}]
						},
						{
							html: 'temak&auml;d',
							text: [{
								html: ' ',
								x: 4, y: 0, w: 1, h: 4
							},
							{
								id: "thumb2",
								x: 0, y: 2, w: 5, h: 1
							}]
						},
						{
							html: 'hid&uuml;nana',
							text: [{
								html: ' ',
								x: 2, y: 0, w: 1, h: 4
							},
							{
								html: ' ',
								x: 4, y: 0, w: 1, h: 4
							},
							{
								id: "thumb3",
								x: 2, y: 1, w: 3, h: 2
							}]
						},
						{
							html: 'os&auml;mikebobs',
							fullImage: "eve06.jpg"
						}
					]
				}
			},
			{
				html: '3',
				target: 2
			},
			{
				html: '4',
				target: 3
			}
		],
		page: [
		{ // page 1
			backgroundImage: "eve01.jpg",
			menuBackgroundColor: { r: 0, g: 100, b: 160 },
			text: [
				{
					html: ' ',
					x: 0, y: 2, w: 2, h: 2
				},
				{
					id: "txt1",
					x: 4, y: 1, w: 2, h: 2
				},
				{
					html: '<h1>b&uuml;dol&ouml;s</h1>',
					x: 4, y: 3, w: 1, h: 1
				}
			],
			menuTarget: [
				{ x: 0, y: 0 },
				{ x: 1, y: 1 },
				{ x: 0, y: 3 },
				{ x: 5, y: 3 }
			]
		},
		{ // page 2
			backgroundImage: "eve02.jpg",
			menuBackgroundColor: { r: 102, g: 102, b: 51 },
			text: [{
					html: ' ',
					x: 5, y: 3, w: 1, h: 1
				},
				{
					html: ' ',
					x: 0, y: 3, w: 1, h: 1
				},
				{
					id: "txt2",
					x: 0, y: 0, w: 3, h: 2
				},
				{
					html: '<h1>kana&auml;nik</h1>',
					x: 5, y: 0, w: 1, h: 1
				}
			],
			menuTarget: [
				{ x: 3, y: 0 },
				{ x: 1, y: 3 },
				{ x: 3, y: 3 },
				{ x: 5, y: 2 }
			]
		},
		{ // page 3
			backgroundImage: "eve03.jpg",
			menuBackgroundColor: { r: 160, g: 100, b: 0 },
			text: [{
					html: ' ',
					x: 0, y: 0, w: 1, h: 1
				},
				{
					html: ' ',
					x: 5, y: 0, w: 1, h: 1
				},
				{
					id: "txt3",
					x: 2, y: 1, w: 3, h: 2
				},
				{
					html: '<h1>l&auml;g&uuml;pt&auml;n</h1>',
					x: 5, y: 2, w: 1, h: 1
				}
			],
			menuTarget: [
				{ x: 1, y: 0 },
				{ x: 1, y: 2 },
				{ x: 5, y: 3 },
				{ x: 5, y: 1 }
			]
		},
		{ // page 4
			backgroundImage: "eve04.jpg",
			menuBackgroundColor: { r: 0, g: 150, b: 150 },
			text: [{
					id: "txt41",
					x: 0, y: 3, w: 2, h: 1
				},
				{
					id: "txt4",
					x: 4, y: 2, w: 2, h: 2
				},
				{
					html: '<h1>sof&auml;lik</h1>',
					x: 3, y: 3, w: 1, h: 1
				}
			],
			menuTarget: [
				{ x: 2, y: 0 },
				{ x: 1, y: 0 },
				{ x: 2, y: 3 },
				{ x: 5, y: 0 }
			]
		}]
	});
}, 500);

</script>
</body>
</html>
